BackendProducto/blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
    def index
        #con el modelo post, busque los post ordenelos por la fecha que creo automaticamente
        @posts = Post.order('created_at DESC')

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def show
        #con el modelo post, busque los post ordenelos por la fecha que creo automaticamente
        @post = Post.find(params[:id])