BackendProducto/blog/app/controllers/users_controller.rb

    def index
        #con el modelo post, busque los post ordenelos por la fecha que creo automaticamente
        @users = User.order('created_at DESC')
---
SELECT "users".* FROM "users" ORDER BY created_at DESC